In [1]:
import pandas as pd
year0 = pd.read_csv("Data/final_tmdb_data_2000.csv.gz", low_memory = False)
year1 = pd.read_csv("Data/final_tmdb_data_2001.csv.gz", low_memory = False)

In [2]:
data = [year0, year1]
combined_df = pd.concat(data)
combined_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2631 entries, 0 to 1423
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2631 non-null   object
 1   adult                  2629 non-null   float64
 2   backdrop_path          1378 non-null   object
 3   belongs_to_collection  202 non-null    object
 4   budget                 2629 non-null   float64
 5   genres                 2629 non-null   object
 6   homepage               194 non-null    object
 7   id                     2629 non-null   float64
 8   original_language      2629 non-null   object
 9   original_title         2629 non-null   object
 10  overview               2578 non-null   object
 11  popularity             2629 non-null   float64
 12  poster_path            2328 non-null   object
 13  production_companies   2629 non-null   object
 14  production_countries   2629 non-null   object
 15  release_date           2613 non-null   object
 16  revenue                2629 non-null   float64
 17  runtime                2629 non-null   float64
 18  spoken_languages       2629 non-null   object
 19  status                 2629 non-null   object
 20  tagline                1127 non-null   object
 21  title                  2629 non-null   object
 22  video                  2629 non-null   float64
 23  vote_average           2629 non-null   float64
 24  vote_count             2629 non-null   float64
 25  certification          870 non-null    object
dtypes: float64(9), object(17)
memory usage: 555.0+ KB

# Data Transformation

In [3]:
#Only keep these specific columns
combined_df = combined_df[["imdb_id", "revenue", "budget", "certification"]]
combined_df.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG

### Normalize Genres Column

In [4]:
basics_df = pd.read_csv("Data/title_basics.csv.gz")
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [5]:
basics_df["genres_list"] = basics_df["genres"].str.split(",")
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_list
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama,[Drama]

In [6]:
exploded_list = basics_df.explode("genres_list")
exploded_list.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_list
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama

In [7]:
genres = sorted(exploded_list["genres_list"].unique())
genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [8]:
title_genres = exploded_list[["tconst", "genres_list"]].copy()
title_genres.head()

      tconst genres_list
0  tt0035423      Comedy
0  tt0035423     Fantasy
0  tt0035423     Romance
1  tt0062336       Drama
2  tt0069049       Drama

In [9]:
numbered_genres = range(len(genres))
genre_id_list = dict(zip(genres, numbered_genres))
genre_id_list

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [10]:
title_genres["genre_id"] = title_genres["genres_list"].map(genre_id_list)
title_genres.drop(columns = "genres_list", inplace = True)
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [11]:
genres = pd.DataFrame({"genre_id" : genre_id_list.keys(), "genre_name" : genre_id_list.values()})
genres.head()

    genre_id  genre_name
0     Action           0
1      Adult           1
2  Adventure           2
3  Animation           3
4  Biography           4

In [12]:
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_list
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama,[Drama]

In [13]:
#Remove unnecessary columns
basics_df.drop(columns = ["originalTitle", "isAdult", "titleType", "genres", "genres_list"], inplace = True)
basics_df.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
2,tt0069049,The Other Side of the Wind,2018,NaN,122
3,tt0088751,The Naked Monster,2005,NaN,100
4,tt0096056,Crime and Punishment,2002,NaN,126

# MYSQL Database Requirements

In [14]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
connection_str ="mysql+pymysql://root:root@localhost/imdb_movies_db"

In [15]:
engine = create_engine(connection_str)

In [16]:
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

In [17]:
combined_df.to_csv("Data/tmdb_data.csv.gz", compression = "gzip", index = False)

In [18]:
combined_df.to_sql("tmdb_data", engine, if_exists = "replace")

2631

In [19]:
q = """SELECT *
FROM tmdb_data
LIMIT 5"""
pd.read_sql(q, engine)

   index    imdb_id     revenue      budget certification
0      0          0         NaN         NaN          None
1      1  tt0113026         0.0  10000000.0          None
2      2  tt0113092         0.0         0.0          None
3      3  tt0116391         0.0         0.0          None
4      4  tt0118694  12854953.0    150000.0            PG

In [20]:
basics_df.to_sql("title_basics", engine, if_exists = "replace")

83047

In [21]:
q = """SELECT *
FROM title_basics
LIMIT 5"""
pd.read_sql(q, engine)

,index,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,0,tt0035423,Kate & Leopold,2001,None,118
1,1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,None,70
2,2,tt0069049,The Other Side of the Wind,2018,None,122
3,3,tt0088751,The Naked Monster,2005,None,100
4,4,tt0096056,Crime and Punishment,2002,None,126

In [22]:
ratings_df = pd.read_csv("Data/title_ratings.csv.gz")

In [23]:
ratings_df.to_sql("title_ratings", engine, if_exists = "replace")

472113

In [24]:
q = """SELECT *
FROM title_ratings
LIMIT 5"""
pd.read_sql(q, engine)

   index     tconst  averageRating  numVotes
0      0  tt0000001            5.7      1919
1      1  tt0000002            5.8       260
2      2  tt0000005            6.2      2541
3      3  tt0000006            5.1       175
4      4  tt0000007            5.4       797

In [25]:
title_genres.to_csv("Data/title_genres.csv.gz", compression = "gzip", index = False)

In [26]:
title_genres.to_sql("title_genres", engine, if_exists = "replace")

155181

In [27]:
q = """SELECT *
FROM title_genres
LIMIT 5"""
pd.read_sql(q, engine)

   index     tconst  genre_id
0      0  tt0035423         5
1      0  tt0035423         9
2      0  tt0035423        18
3      1  tt0062336         7
4      2  tt0069049         7

In [28]:
genres.to_csv("Data/genres.csv.gz", compression = "gzip", index = False)

In [29]:
genres.to_sql("genres", engine, if_exists = "replace")

26

In [30]:
q = """SELECT *
FROM genres
LIMIT 5"""
pd.read_sql(q, engine)

   index   genre_id  genre_name
0      0     Action           0
1      1      Adult           1
2      2  Adventure           2
3      3  Animation           3
4      4  Biography           4

In [31]:
q = """SHOW TABLES FROM imdb_movies_db"""
pd.read_sql(q, engine)

  Tables_in_imdb_movies_db
0                   genres
1            title ratings
2             title_basics
3             title_genres
4            title_ratings
5                tmdb_data